//  Created by students on 18.04.2020.
//  Bartłomiej Kubiak & Jan Wądołowski
//

#include "Bicycle.h"

using namespace std;
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

//constructors/destructors
Bicycle::Bicycle(const string &id, const int baseRentPrice) : Vehicle(id, baseRentPrice) {}
Bicycle::~Bicycle() = default;
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------