//  Created by students on 18.04.2020.
//  Bartłomiej Kubiak & Jan Wądołowski
//

#ifndef BICYCLE_H
#define BICYCLE_H

#include "Vehicle.h"
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

class Bicycle: public Vehicle {

public:
    //constructors/destructors
    Bicycle(const std::string &id, const int baseRentPrice);
    ~Bicycle();

};
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

#endif //BICYCLE_H
